rottenpotatoes/app/controllers/movies_controller.rb

INSERT INTO "movies" ("title", "created_at", "updated_at") VALUES (?, ?, ?)  [["title", "Random Movie 4"], ["created_at", "2022-10-26 03:25:47.395554"], ["updated_at", "2022-10-26 03:25:47.395554"]]
---
  def create
    @movie = Movie.create!(movie_params)

SELECT  "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", 3]]
UPDATE "movies" SET "director" = ?, "rating" = ?, "release_date" = ?, "updated_at" = ? WHERE "movies"."id" = ?  [["director", "Ridley Scott"], ["rating", "G"], ["release_date", "2022-10-25 00:00:00.000000"], ["updated_at", "2022-10-25 16:18:48.596981"], ["id", 3]]
---
  def update
    @movie = Movie.find params[:id]
    @movie.update_attributes!(movie_params)

SELECT  "movies".* FROM "movies" WHERE "movies"."title" = ? LIMIT 1  [["title", "Star Wars"]]
---
  def search_same_director
    @movies_with_same_director = Movie.others_by_same_director(params[:title])
    if @movies_with_same_director.nil?
      redirect_to root_url, alert: "'#{params[:title]}' has no director info"
    end
    @movie = Movie.find_by(title:params[:title])